{
    "experiences": [
          {
            "title": "Senior Staff UI Engineer",
            "subtitle": "Palo Alto Networks",
            "workType": "Full-time",
            "workDescription": [
                "Integral part of the NetSec engineering UI team, driving the development of innovative, scalable front-end solutions that enhanced network security data analysis and user engagement by 25%",
                "Championed best practices in software engineering, mentoring team members and introducing new tools that reduced development cycle times by 20% and enhanced software quality",
                "Developed complex, data-driven web features that increased actionable security insights by 30%, significantly improving decision-making processes for security administrators",
                "Initiated and led process improvements that aligned product development with business goals, increasing project delivery efficiency by 15% and fostering an agile engineering culture",
                "Spearheaded the adoption of test-driven development and continuous integration, which improved code quality by 40% and accelerated development timelines, setting a benchmark for engineering excellence"
            ],
            "dateText": "01/2025 – Present"
        },
        {
            "title": "Senior MTS - Full Stack",
            "subtitle": "Prosimo.io",
            "workType": "Full-time",
            "workDescription": [
                "Delivered full-stack features using Angular & Go, reducing development time by 30% through effective planning and prioritization.",
                "Responded swiftly to customer needs in a startup environment, delivering features and bug fixes within 24-48 hours",
                "Led discussions with the product and QA teams to enhance UX and ensure bug-free applications with end-to-end testing (Cypress).",
                "Designed and developed scalable RESTful APIs in Go, improving backend response times by 40%.",
                "Ensured code quality and accelerated development through PR reviews, testing, and mentoring team members."
            ],
            "dateText": "07/2019 – 01/2025"
        },
        {
            "title": "Software Engineer Intern - Full Stack",
            "subtitle": "Mist Systems",
            "workType": "Internship",
            "workDescription": [
                "Developed an Elasticsearch web application to back up customer data to AWS S3 which saved 40% of efforts.",
                "Improved Grafana dashboard layout on both production and staging for efficient lookups"
            ],
            "dateText": "06/2018 – 12/2018"
        },
        {
            "title": "Software Engineer - Full Stack",
            "subtitle": "Tata Consultancy Services",
            "workType": "Full Time",
            "workDescription": [
                "Developed a Trulicity web application to be used by 50000+ patients for an American Pharmaceutical Company",
                "Integrated AngularJS with Java APIs for efficient frontend-backend communication."
            ],
            "dateText": "08/2015 – 06/2017"
        }
    ]
}